Go_test.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        27 bytes

Concurrency Level:      100
Time taken for tests:   17.326 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      18500000 bytes
HTML transferred:       2700000 bytes
Requests per second:    5771.63 [#/sec] (mean)
Time per request:       17.326 [ms] (mean)
Time per request:       0.173 [ms] (mean, across all concurrent requests)
Transfer rate:          1042.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       5
Processing:     1   17   2.0     17      35
Waiting:        1   17   2.0     17      35
Total:          1   17   1.8     17      35

Percentage of the requests served within a certain time (ms)
  50%     17
  66%     18
  75%     18
  80%     18
  90%     19
  95%     20
  98%     22
  99%     24
 100%     35 (longest request)

 
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.27.1
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        27 bytes

Concurrency Level:      1000
Time taken for tests:   33.751 seconds
Complete requests:      100000
Failed requests:        107
   (Connect: 0, Receive: 0, Length: 107, Exceptions: 0)
Total transferred:      18480205 bytes
HTML transferred:       2697111 bytes
Requests per second:    2962.87 [#/sec] (mean)
Time per request:       337.510 [ms] (mean)
Time per request:       0.338 [ms] (mean, across all concurrent requests)
Transfer rate:          534.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.9      0      30
Processing:     9  210 1482.2     90   31677
Waiting:        0  210 1482.2     90   31677
Total:         31  210 1482.3     90   31677

Percentage of the requests served within a certain time (ms)
  50%     90
  66%     92
  75%     94
  80%     95
  90%    122
  95%    127
  98%   1029
  99%   1560
 100%  31677 (longest request)